app/controllers/main_controller.rb

SELECT * FROM "mains" LIMIT 1
---
def index
	@main=Main.first