app/controllers/redirect_controller.rb

def index
	paciente = Paciente.find(:first, :conditions=>["nome LIKE ?", "#{params[:path].first}%"])
---
SELECT * FROM "pacientes" WHERE (nome LIKE 'aline%') LIMIT 1