app/controllers/usuarios_controller.rb

SELECT * FROM "usuarios"
---
  def index
    @usuarios = Usuario.all

SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 1)
---
  def show
    @usuario = Usuario.find(params[:id])

INSERT INTO "usuarios" ("nivel", "created_at", "nome", "updated_at", "user") VALUES(1, '2010-08-12 19:07:38', 'Marlon', '2010-08-12 19:07:38', 'marlonglopes')
---
  def create
    @usuario = Usuario.new(params[:usuario])
    if @usuario.save